{"restaurantID":"V6Om7YZhlRQRU7WfuxHq8Q","reviewerID":"ci7Q6NvXQ8UZrBHusVX18g","rating":4,"reviewUsefulCount":1,"reviewContent":"A wee bit pricey for the portions they serve. I come to Beck's for their gator gumbo over jambalaya. The whole thing is just so savory and the spices are just right. It's not overly spicy and not too salty as well. It's a great meal. The gator is in a sausage form. All chopped up into the gumbo. During this visit, I had to order their pasta. Chicken alfredo, for my 2 year old son. It was alright. The whole pasta tasted a bit dry. It's something I wouldn't get twice.  Verdict - Gator gumbo, end of story.","date":"2017-07-08","reviewCount":1289,"usefulCount":8683,"coolCount":5751,"funnyCount":4936,"complimentCount":347,"fanCount":227,"restaurantRating":4.0}
{"restaurantID":"diwwt5QBU3-Thig9SVlsOA","reviewerID":"EROW4chFZQF1E-eZVpYAAA","rating":2,"reviewUsefulCount":0,"reviewContent":"The only good part....   Their stage is really cool! Raised up, lights that move around, good sound system, a fog machine, and a pretty big dance floor.    But their food service.... crappy both times Ive been there.   The last time I was there I walked in, hadn't been greeted by anyone at the empty front podium, and just found a table. I figured once I sat down Id wait for an employee to get back to the menus and go up and ask for one. So I saw a lady working up at the front and went up and asked her.  She said that they stopped serving food at...... I cant remember if it was 9 or 10 pm.... but she gave me a certain time that the kitchen closed. I went back to my table and looked at the time. It was 10 minutes before the time she told me the kitchen closed. I thought that was kinda dumb, but oh well.... maybe they stopped taking orders 10 minutes ahead or something. The next thing I see the SAME EXACT LADY seat four people RIGHT NEXT to our table and give them menus. Then she takes their order, and brings out their food. All I wanted were some freakin french fries and I had to sit there and watch the people who got there long after me eating french fries instead. RUDE!","date":"2009-08-05","reviewCount":57,"usefulCount":95,"coolCount":43,"funnyCount":33,"complimentCount":3,"fanCount":3,"restaurantRating":3.5}
{"restaurantID":"W4ZEKkva9HpAdZG88juwyQ","reviewerID":"0MeivhX0kZCfV3zMtHtk9Q","rating":4,"reviewUsefulCount":0,"reviewContent":"Excellent food, good service, great location.   My wife had shrimp and grits, I had the barbecued shrimp -- both were outstanding. The appetizers were good. The bread pudding was a tad dry in the city that is supposed to be the mother lode of bread pudding.   Mr. B came close to snagging the fifth star but the service could have been more attentive and the place is freezing - - in July in New Orleans. Wear long sleeves or bring a jacket.","date":"2009-08-03","reviewCount":897,"usefulCount":3214,"coolCount":1891,"funnyCount":1491,"complimentCount":40,"fanCount":96,"restaurantRating":4.0}
{"restaurantID":"AzseSGgDC6bVtMPEYo1CNQ","reviewerID":"o4tYl3Hz0oDfpNn4k02DCw","rating":4,"reviewUsefulCount":5,"reviewContent":"Came in after attending the Zurich Classic golf tournament. It was a warm and a bit humid so what tastier then a ice cream cone? I lucked out and found a parking space on the street. The interior is quite cute and comfy.  The selection here is crazy huge but after sampling a couple of unusual flavors I went with the scoop of cookie monster ice cream on a cone. The ice cream hit the spot and I enjoyed it BC it wasn't overly sweet.  Creole Creamery was definitely worth checking out!","date":"2013-05-07","reviewCount":1708,"usefulCount":23700,"coolCount":19371,"funnyCount":13551,"complimentCount":1521,"fanCount":513,"restaurantRating":4.5}
{"restaurantID":"bJAY2baMKSTlWRc-QZGopQ","reviewerID":"_BcWyKQL16ndpBdggh2kNA","rating":3,"reviewUsefulCount":2,"reviewContent":"I like the Neuvo-Latino-Americano grub here.  The place has moved locations and is now a bit larger.  Chips & Salsa are always fresh 7 tasty, too.  I wish I could give a more substanital review but I ate here so long ago - and at the old location - so I'd better just keep my mouth shut.","date":"2008-12-04","reviewCount":4274,"usefulCount":16950,"coolCount":9759,"funnyCount":5203,"complimentCount":357,"fanCount":558,"restaurantRating":3.5}
{"restaurantID":"tD_2Pw2kiUGE-lIkFTQKLw","reviewerID":"_BcWyKQL16ndpBdggh2kNA","rating":3,"reviewUsefulCount":2,"reviewContent":"Got an estimate but went with another plumber as this was the highest quote of the 3 plumbers we interviewed for the job. Very prompt communication though.  Will re-consider for future jobs.  Seems reliable (and often you get what you pay for!)","date":"2015-02-02","reviewCount":4274,"usefulCount":16950,"coolCount":9759,"funnyCount":5203,"complimentCount":357,"fanCount":558,"restaurantRating":4.0}
{"restaurantID":"otQS34_MymijPTdNBoBdCw","reviewerID":"4Uh27DgGzsp6PqrH913giQ","rating":4,"reviewUsefulCount":0,"reviewContent":"The bun makes the Sonoran Dog. It's like a snuggie for the pup. A first, it seems ridiculous and almost like it's going to be too much, exactly like everyone's favorite blanket with sleeves. Too much softness, too much smush, too indulgent.  Wrong. It's warm, soft, chewy, fragrant, and it succeeds where other famed Sonoran Dogs fail.   The hot dog itself is flavorful, but I would prefer that it or the bacon have a little more bite or snap to better hold their own against the dominant mustard and onions.   I'm with the masses on the carne asada caramelo. Excellent tortilla, salty, melty cheese, and great carne.   Super cheap and you can drive through.","date":"2011-10-27","reviewCount":50,"usefulCount":146,"coolCount":77,"funnyCount":106,"complimentCount":18,"fanCount":2,"restaurantRating":4.0}
{"restaurantID":"zVoxVPHEt11_0GzqNuT2ZQ","reviewerID":"HuoP7ejN-LSwkO1UIgmtaw","rating":4,"reviewUsefulCount":4,"reviewContent":"First impression:  Home Wine Kitchen's \"No Menu Monday\" is a must-try for anyone interested in the St. Louis fine dining scene or good food more generally.  We came prepared with reservations, but the restaurant actually began quieting out while our delicious meal was ramping up; the tables offer more elbow room than the photographs online belie.  As the name of the evening suggests, no menu is in play here; you'll let your friendly server know if you have any food allergies or particular preferences, and before long watch your customized meal unfold.  That's a three-course meal, $30, plus $12 for three half-glass wine pairings.  As starters, we were served lamb meatballs -- likely the favorite of the night -- and goat cheese-stuffed poblano peppers.  The peppers had a good bit of spice offset by the chalkiness of the goat cheese, making an excellent pairing for my Soave (white wine).  The mains were a corvina fish delicately cooked in wax paper and a swordfish steak served over asparagus with homegrown tomatoes and \"love sauce.\"  The corvina came out on the rarer side, perhaps a little too complex for this Midwesterner's palate, but the hearty swordfish was some of the best seafood I've tasted in Missouri.  Dessert comprised a champagne gelatin and a chocolate tart, both of which were topped by fluffy homemade whipped cream and quickly eaten.  The staff at Home Wine Kitchen made our visit pleasant, acting casual yet professional during our meal.  The restaurant patrons seemed to be largely industry types that oohed and aahed about the cuisine (perhaps a trifle self-importantly, but this Yelper is no saint himself).  I was surprised to note that other diners were served the same courses as we were (albeit in different configurations), when I was under the assumption there would be a little more variation; however, I can only imagine the challenge such an endeavor would pose to the talented kitchen.  The interior, lighting, and volume here were all very good.  By the end of the evening, we realized that putting yourself in the hands of the chef is not for the faint of heart, as evidenced by one conversation near us during the meal that all but stopped when a beautiful whole fish was served to the table.  Leaving the restaurant, I was glad that I had tried No Menu Monday, but did wonder what the meal would have been like had I ordered off the menu.  I guess that calls for a return visit, don't you?","date":"2011-08-25","reviewCount":342,"usefulCount":838,"coolCount":424,"funnyCount":290,"complimentCount":85,"fanCount":29,"restaurantRating":4.0}
{"restaurantID":"i-tDq8zC7ZmSqSbg_7oddA","reviewerID":"Xw7ZjaGfr0WNVt6s_5KZfA","rating":5,"reviewUsefulCount":11,"reviewContent":"What an AMAZING occurrence that we ended up here after another barbecue place ran out of food!  So yeah, we started out at another spot and they were out of food when we got there. Super bummed and still in the mood for barbecue, we started wandering around Mid City and my trusty Yelp app guided me to this place. We were greeted by the super nice woman working the counter and she explained the whole process.  I decided to get the one-meat plate with \"wet\" pulled pork, grits and potato salad, I also got a medium mac and cheese, because I can. My boyfriend got the two-meat plate with brisket and pulled chicken with potato salad and fries. The food blew us both away! It was delicious from beginning to end. The pulled pork was perfect and had the perfect amount of sauce without being drenched. I could tell that if I hadn't ordered it wet it still would have been able to stand on it's own. The mac and cheese was incredible, and after the pork, was my favorite part of the meal. The stone ground grits had a different type of flavor (almost smoky) that I enjoyed and the potato salad was served cold and had that nice crunch that I like in potato salad,  We both agreed that the food was excellent, and a good deal to boot, and that we would both make the trip back out to Earhart, just to have more of this delicious food. The owner himself was bringing the food out to folks and he was really friendly and made sure that we were happy with everything. I like when the owners take the time to make sure that everything is okay. The atmosphere is casual and comfortable and the entire process was a breeze. I will definitely return to LA Smokehouse and I'll be adding it to my \"BBQ Favorites\" list for future reference.","date":"2016-11-21","reviewCount":2272,"usefulCount":15105,"coolCount":9532,"funnyCount":6729,"complimentCount":344,"fanCount":379,"restaurantRating":4.0}
{"restaurantID":"actDmpJyaQPnkds6knMdKA","reviewerID":"0Igx-a1wAstiBDerGxXk2A","rating":5,"reviewUsefulCount":3,"reviewContent":"Say you decide that you need a new door...and you only have $35.  Where do you go?  the Green Project.   Or you have a bunch of left over building supplies, random bits of lumber, some roofing materials, maybe even some paint?  Where can you bring it so it doesn't end up in a landfill?  Again, the Green Project.","date":"2009-03-01","reviewCount":2733,"usefulCount":13793,"coolCount":8701,"funnyCount":5457,"complimentCount":468,"fanCount":200,"restaurantRating":4.5}
{"restaurantID":"P8QLcGZZOPgl9w_3ARBKiQ","reviewerID":"jqTa-RtGU26q3TFTmMZOAw","rating":2,"reviewUsefulCount":1,"reviewContent":"So we've been wanting to try the sushiritos since they opened up a location closer to us and we finally tried it last Friday.   I got the slammin' salmon and my wife got the crunch. I'd say they both definitely had fresh ingredients, and definitely tasted fresh, but I think the balance of flavors wasn't quite right for the slammin' salmon. Way too heavy on the sauce, completely overpowering the crisp fresh veggies and salmon.   We tried the Japanese fried chicken. Sauce is a little sweet and sour. And the chicken was a little dry.   We also tried their green tea and lemonade, which were pretty good, but you don't come to a place like this because their green tea and lemonade are their best things on the menu.   Overall, you pay a high premium for a gimmicky meal. With this location being essentially at a revolving door of new customers on the corner of Penn's campus, I think they have the potential to do well. But I don't think I'll be coming back. We'll take our $34 elsewhere.","date":"2015-03-05","reviewCount":218,"usefulCount":419,"coolCount":188,"funnyCount":94,"complimentCount":20,"fanCount":15,"restaurantRating":3.5}
{"restaurantID":"oha2U5XJzc6IQdenpsxN1Q","reviewerID":"Q503wfkVgYYRisTYSyWYww","rating":3,"reviewUsefulCount":2,"reviewContent":"A small aquarium that is interesting mainly for kids.  They have a shark feeding show and stingrays that you can pet and buy food to feed.  It is not the first place i would go in Tarpon Springa, but it is ok, small children seem to like it.","date":"2008-12-06","reviewCount":485,"usefulCount":1729,"coolCount":1169,"funnyCount":952,"complimentCount":81,"fanCount":52,"restaurantRating":3.5}
{"restaurantID":"nFjk0xVI9fNiVN__5g-m8Q","reviewerID":"nnImk681KaRqUVHlSfZjGQ","rating":5,"reviewUsefulCount":4,"reviewContent":"Ichicoro Ane gets lots of things right and the best part about it is the combination of the ambiance with the food choices and whiskey selection. I'm very happy with this location and the servers I have encountered so far have been helpful and pleasant.  The katsu is great and I highly recommend it to people looking for a more filling dish on the menu. The bao buns were also good for a lighter fish. I haven't had anything I really regretted trying, but definitely ask your server about the portion sizes of each dish since they vary across the menu.  The cocktail selection is excellent. I even had a special Japanese Old Fashioned last time which was a little expensive, but well worth it for some quality Japanese whiskey.   I'm looking forward to exploring the menu little by little. The best way to experience this is in a group setting so you can try more things and it really reminds me of Izakayas or Japanese pubs I visited in Japan and Korea.","date":"2018-02-23","reviewCount":1107,"usefulCount":4887,"coolCount":3165,"funnyCount":1663,"complimentCount":113,"fanCount":259,"restaurantRating":4.0}
{"restaurantID":"bdth7r1brx9yRU7sYwF9jQ","reviewerID":"kfiBpwAZFxAo_RcrBmQjbA","rating":3,"reviewUsefulCount":3,"reviewContent":"Despite it's great reviews by other Yelpers, I was not that blown away by Nippon Tei.   My roommate and I were craving sushi and were recommended to come here by Yelp and a friend so we decided to give it a shot.   First off, they get bonus points for serving FREE edemame as an appetizer. I usually pay $4 to $5 for it at other sushi restaurants. The mango sake drink I have was alright, but not worth the price I paid for it.   On to the main event...SUSHI! We had the philly roll, tempura roll, tuna roll, and california roll. They were all yummy, but I would have to say I have had better. Actually, out of the hand-full of sushi restaurants I have tried, this was the worst sushi I have tried, but I cannot say the sushi was bad by any means. Don't get me wrong, it was still tasty.   The other big thing was that the rolls were actually falling apart. I have never had this happen. Therefore, I can say that the presentation and the ability to get the sushi from the plate to my mouth without falling apart did make me unhappy.   I am willing to come back to Nippon Tei, but I have to say I already have my other favorites. The prices were average compared to other sushi bars, so that won't really help them out either when it comes to bringing me back. We will see!","date":"2010-08-22","reviewCount":313,"usefulCount":899,"coolCount":497,"funnyCount":235,"complimentCount":96,"fanCount":25,"restaurantRating":4.0}
{"restaurantID":"SIoCIxjn4jLt2O-4DajWJw","reviewerID":"5Fk3pRHy5iqu3Bvo_zj5DA","rating":3,"reviewUsefulCount":0,"reviewContent":"This place has a few good things going for it:   1. REALLY good gravy fries...seriously, if you haven't had them yet - you haven't lived 2. The staff here is friendly and entertaining! Don't let it alarm you if a waitress and a member of the kitchen staff randomly have a lover's quarrel...its all part of the character of the place! lol! 3. It is the perfect bar to watch ANY Philly sports team...but especially the Phillies.  4. Pretty good beer selection, too!","date":"2011-04-23","reviewCount":51,"usefulCount":56,"coolCount":16,"funnyCount":12,"complimentCount":3,"fanCount":2,"restaurantRating":3.5}
{"restaurantID":"j5U5O3scMvPe67jzJcWFug","reviewerID":"8bKjmdE9h9Jc8hzCO7EJsQ","rating":5,"reviewUsefulCount":0,"reviewContent":"First of all, I think this might be my first Yelp review about \"fast food.\" It's not a genre I ever eat unless I'm forced to on a road trip.  However, I am from Buffalo, NY, and am a chicken-finger connoisseur, so I decided to give this place a chance.  Additionally, it was on a road trip of sorts.  We had been at the beach all day and were halfway back home to central Tampa.  The service is amazing!  I have never seen fast-food workers who take so much pride in their jobs.  These people were drinking the Zaxby's cool-aid!  They seemed more like Disney employees than fast-food workers.  Both a female counter gal and a male (possible the manager/franchisee) went out of their way to make sure we liked everything.    The food was a solid 4 stars, but my review overall is rounded up for the above mentioned points.  We had the chicken finger sandwiches on Texas toast.  While the chicken fingers themselves were super juicy and moist, the Texas toast was too greasy to eat them on.  I love sauce and enjoyed the variety.  We tried the Zax, hot honey mustard, insane hot and ranch.  What is missing from the sauce variety, for me, is a spicy bbq and blue cheese.  Serving ranch with hot sauce is an insult to the folks in Buffalo that created the cuisine.  Aside from the bread and sauce small issues, I really enjoyed our meal.  Additionally, it was so cheap!!  $12 and change for 2 meals with drinks.    I am a fan!  This place doesn't quite hit all the marks of Buffalo-Inspired food, but it does a pretty good job of putting a southern twist on chicken fingers!","date":"2017-08-16","reviewCount":469,"usefulCount":1015,"coolCount":425,"funnyCount":209,"complimentCount":12,"fanCount":38,"restaurantRating":3.0}
{"restaurantID":"hRHhP3fhMy3LktPyQa3s_A","reviewerID":"WJnyWEe_YK7JO47fcovBVw","rating":3,"reviewUsefulCount":0,"reviewContent":"Good choice in Union Station St. Louis.  I had the Ponchartrain (server said it is same as Tilapia, though that was also on the menu, so why two names for the same fish, I have no clue).  The Ponchartrain was quite good with mushrooms and a cream sauce.  We also had the shrimp cocktail and lump crab cake appetizers....both fine, but not wonderful.  Drinks and service were perfectly acceptable.  We dined outside on the patio since the weather was nice - inside looks comfy and a bit less casual.","date":"2008-08-20","reviewCount":131,"usefulCount":178,"coolCount":81,"funnyCount":23,"complimentCount":3,"fanCount":7,"restaurantRating":3.0}
{"restaurantID":"OUuUc_qERdvTrnpj1vSLaw","reviewerID":"E3emexIUWqPX6zUsLSZ5Xw","rating":4,"reviewUsefulCount":0,"reviewContent":"We've been going to this place since it opened and it's always decent, not to mention super fast! TdM is owned by Subway and has a similar feel to it, but I think the quality is much better than Subway. It's a build-your-own burrito and taco place and the ingredients are always fresh and well-stocked. I usually eat vegetarian, so there are plenty of options for me to eat. I always get a veggie burrito and load it up with lots of veggies! I also like their chips and \"medium\" salsa. If ever around Delgado, check out Taco del Mar!","date":"2014-04-20","reviewCount":52,"usefulCount":52,"coolCount":23,"funnyCount":9,"complimentCount":0,"fanCount":2,"restaurantRating":3.5}
{"restaurantID":"aZNiVR6oAMQX5__yGPvYsg","reviewerID":"uAu772KpSkb-tPFgZmU-lA","rating":3,"reviewUsefulCount":1,"reviewContent":"My first trip to Susanna Foo was at 6 months old when the restaurant was still a hole-in-the-wall takeout joint owned by Susanna's parents. My parents have been taking my brother and I ever since. I have many fond memories of Susanna fashioning dolls for us out of the linen napkins and preparing Chicken with Cashew Nuts when we refused to eat anything else. The food has always been reliable, but now that I am an adult, I find it lacking excitement. The service is always impeccable and I have never been disappointed by the overall decor or ambience. I'd like to see Susanna improve upon some of her traditional recipes by either adding new flavors or perhaps returning to her Chinese roots with a more ethnic menu. I'm hoping there will be a revitalization and that I will come to love Susanna Foo as much as I did as a child.","date":"2008-12-03","reviewCount":286,"usefulCount":838,"coolCount":381,"funnyCount":195,"complimentCount":19,"fanCount":18,"restaurantRating":3.5}
{"restaurantID":"2GYg3liJ9-m6Z67L_4_BRQ","reviewerID":"uAu772KpSkb-tPFgZmU-lA","rating":5,"reviewUsefulCount":7,"reviewContent":"I LOVE Weaver's Way and really disagree with some of the content in previous reviews. WW is not necessarily meant for convenience shopping. I am a single woman and I find that I have no trouble shopping at the co-op, during peak times or otherwise. I actually find the co-op to be a great place to shop if you live alone because I can get smaller quantities of items than if I shop at the corporate stores like Acme. I also enjoy the work hours - I've worked throughout the store, but most recently, I have been getting in my hours by participating in the membership committee. I wouldn't say that the community is necessarily made up of \"tree huggers\" and \"earth children\", though. The community is made up of a variety of similarly-minded folks from different backgrounds. I enjoy having a place to go to where I can obtain locally grown produce, a place that offers more natural, wholesome, and preservative-free foods than chain stores with prices way below that of Whole Foods. I enjoy interacting with other members and contributing to my local and global community. I don't find the membership fee or the work hours to be prohibitive being a single person vs. a family. I don't think that membership in a co-op is for everyone and, if you aren't single, it's definitely not a solo decision. If you're keen on being committed to the Weaver Way values, you couldn't find a better place to shop. If not, stick to the chain stores or just pay the 10% visitors' fee to pop in once in a while.","date":"2008-12-03","reviewCount":286,"usefulCount":838,"coolCount":381,"funnyCount":195,"complimentCount":19,"fanCount":18,"restaurantRating":4.5}
{"restaurantID":"oEbpO3vmcrGDW2mtb_s8cQ","reviewerID":"H4JNrBAoyCk_ZMZWbAf8OA","rating":4,"reviewUsefulCount":1,"reviewContent":"Located right at the Union Station Metro stop (walking distance to all of downtown but metro-able too), this place was a good deal on the weekend.  Prices spike during the week when business-peeps fly in and their companies are paying the bill.  The room was clean, the bed was super comfy with TONS of pillows (one sure way to my heart).  The bathroom was large with a tub and too many white towels for two people.  Subtracted one star cause the coffee machine in our room sucked and the door was thin so you could hear people/children in the hall at WAY too early in the morning.  The main lobby is really a cool place tho.  Definitely worth checking out if you're in the area.","date":"2007-05-23","reviewCount":607,"usefulCount":1502,"coolCount":996,"funnyCount":880,"complimentCount":117,"fanCount":102,"restaurantRating":3.5}
{"restaurantID":"-hVMfjPPEsSnga_gnYJx2w","reviewerID":"H2WhI7u2Zc-ozPnKBvhWwQ","rating":5,"reviewUsefulCount":1,"reviewContent":"A great lunch or dinner stop in Reno, NV.    We've had some fine meals in this establishment......Tyler (manager) does a great job with his staff, and it shows in the overall results.  They are also a pub, so its got a great selection of beers and wines too!","date":"2007-12-08","reviewCount":1144,"usefulCount":5279,"coolCount":2729,"funnyCount":2332,"complimentCount":49,"fanCount":70,"restaurantRating":4.0}
{"restaurantID":"vOgQnvKbE4nMopFTjoL8Gg","reviewerID":"q-EBNzv_YO5CE0Q_Ln7D5Q","rating":2,"reviewUsefulCount":2,"reviewContent":"Pretty bummed I didn't try out the Catbird Seat, because this place was totes underwhelming. When you enter, there is a large, awkward entrance and you have to go upstairs to be seated. It was probably only half full, but since it was strange weather, we decided to sit indoors. I'll just say again, walking up towards the hostess as she watches you approach just feels....weird.   Our server was nice, and we joked with him about the silly flower in a very knock-over-able vase. We got two drinks--julep and one of their other ones with gin, both of which were utterly average to bad.   The crowd was sort of stuffy. The bread was blah. The food was pretty forgettable. The tenderloin was good because it was a good cut of meat. The Amish chicken was pretty average, with a not so flavorful and slightly MSG-y twang jus. Their signature grits was underwhelming as well.   All in all, stuffy and so overpriced. Bummed out!","date":"2013-05-29","reviewCount":144,"usefulCount":379,"coolCount":152,"funnyCount":162,"complimentCount":12,"fanCount":12,"restaurantRating":4.0}
{"restaurantID":"VbItL6RDULtnw4YvB6EhVg","reviewerID":"BmThnFPDalpbC1x98aXKaw","rating":1,"reviewUsefulCount":4,"reviewContent":"They served me a frozen pizza and skunked beer.  'Nuff said.","date":"2008-04-30","reviewCount":233,"usefulCount":1386,"coolCount":780,"funnyCount":509,"complimentCount":103,"fanCount":38,"restaurantRating":3.0}
{"restaurantID":"CinrOH8rMB2hEvPY_iFOHA","reviewerID":"7ktyPHE-NGnWxarOqjIQiQ","rating":1,"reviewUsefulCount":3,"reviewContent":"I really wanted to like Casselli's, but it wasn't in the cards. Maybe I just caught them on a bad night, but I didn't really enjoy much about my visit. The waiter was very unpleasant - was banging down the plates and glasses on the table when he delivered them. Maybe he was having a bad day, but I still would have expected better.   We had mixed experiences with the food. Mine and our friends' was OK, but my wife's baked ravioli would have been more use to a hockey team for use as pucks. They were really overdone - woefully overdone.   The worst part was that our table was next to the opera singer guy. He was singing extremely loudly and it was nigh impossible to maintain a conversation - especially coupled with how close we were to the table next to us and their attempts to speak over Opera Guy.  Part of me wants to give them another chance (since I hate writing bad reviews) and the other part is annoyed over the waiter's attitude. I probably will not go back. There are so many good Italian restaurants worth visiting that the opportunity cost of returning to Casselli's seems too high.  On the upside, they have somewhat convenient parking in the lot behind the restaurant (near the Shawmont School).  Note: cash-only.","date":"2009-03-02","reviewCount":416,"usefulCount":902,"coolCount":441,"funnyCount":356,"complimentCount":34,"fanCount":25,"restaurantRating":3.5}
{"restaurantID":"iD25g7vUG3asELjXtMGF9w","reviewerID":"kHmXUEOAsIbguUrPoX6Tkg","rating":2,"reviewUsefulCount":2,"reviewContent":"Meh is all I can say for TDS. The restaurant itself is just cold.... not literally, but figuratively. There was no decor, no menu boards, stainless steel prep tables as dining tables, no soda machines, staff EVERYWHERE with no identification (shirts, nametags, etc). The food is reasonably priced and most of it was quite good, but what really irked my party was the fact that they charge for extra salsa!!! We ordered a salsa trio (which included 3 samples of the various salsas, in 2oz glass prep bowls), and when my brother asked for more salsa for his tacos (mind you, we ordered one of ever taco, three burritos and guacamole), he was told he'd have to buy the trio again! Really!!??? We spent over $40 on food, drinks and apps, too. Even though the food was decent, I wouldn't return as the atmosphere is just blah and you can't get extra salsa for your damn tacos!","date":"2012-12-04","reviewCount":236,"usefulCount":322,"coolCount":84,"funnyCount":82,"complimentCount":4,"fanCount":8,"restaurantRating":3.5}
{"restaurantID":"xZcUgkmAWTeS0F7K92eglg","reviewerID":"OH6KVbvDnGs0zWhYj5A9Yg","rating":5,"reviewUsefulCount":0,"reviewContent":"I have only been here on a few occasions, mostly to send the random package, I like that this location has one of the automated machine (the post office closest to me does not...)  But what I wanted to highlight was the fantastic customer service my husband and I experienced when we went here to get our passport applications submitted, the representative we worked with was awesome. She was fast, friendly and knew exactly what needed to be done so we were in and out super quick! She even gave me the follow up forms and explained what I would need to do once I changed my name, perfect. I hope every experience here in the future is just as good. She should train everyone.","date":"2013-10-03","reviewCount":252,"usefulCount":531,"coolCount":261,"funnyCount":103,"complimentCount":19,"fanCount":23,"restaurantRating":3.5}
{"restaurantID":"Z9QN-2Sg0pD0AAaiMl9oHA","reviewerID":"ao-AH4CKrHlJLdrxYm9reg","rating":4,"reviewUsefulCount":0,"reviewContent":"Great hiking, biking, running spot. Lots of well maintained paths. Beautiful views and spots with shade which is great when you're hiking in the heat. Only complaint is that people don't follow the dogs on leash rule and I came across at least 6 dogs off leash and away from their owners. Just follow the rules or they will make it a no dog spot!!!!","date":"2017-06-27","reviewCount":806,"usefulCount":938,"coolCount":366,"funnyCount":275,"complimentCount":9,"fanCount":29,"restaurantRating":4.5}
{"restaurantID":"4-CxVJ9n6TPPAmKV7DEOlQ","reviewerID":"2Pqs3nedztBqwQE7zO5yiQ","rating":5,"reviewUsefulCount":2,"reviewContent":"My first time here! Grace did my hair....and it's FABULOUS! (And my hair is very difficult---super long and super thick). Great atmosphere, too--modern and clean, and no snobbiness.  Totally reasonable pricing! Highly recommend!","date":"2011-07-29","reviewCount":17,"usefulCount":27,"coolCount":2,"funnyCount":2,"complimentCount":1,"fanCount":1,"restaurantRating":4.5}
{"restaurantID":"PY9GRfzr4nTZeINf346QOw","reviewerID":"c8qFkI_VusWo0xZvkjfBWQ","rating":5,"reviewUsefulCount":0,"reviewContent":"Best casino in Reno.   4 deck and 2 deck blackjack, real drink glasses (no plastic fratboy cups), amazing decorum that will burn your retinas, and the restaurants inside are better the big casinos on the strip by a factor of a thousand.  The rooms are stellar for the price.  Get a hot tub and chilllllll.","date":"2005-05-15","reviewCount":374,"usefulCount":280,"coolCount":199,"funnyCount":187,"complimentCount":7,"fanCount":21,"restaurantRating":4.0}
{"restaurantID":"2myVMP_l-9f9JIZewm19Cg","reviewerID":"KepicN2NnZ5aPXVlBypHOQ","rating":3,"reviewUsefulCount":0,"reviewContent":"Great place to stay if you want to be on Bourbon street.  The staff is really hospitable and didn't fail me on food choices.  The room is nice and big.  However, I stayed in room 263 and thought it was perfect because it was not a room that faced Conti.  I was wrong because it was closer to the vending and ice machines.  The door/wall was thin enough that I heard conversations in the hall next to the vending machines.  I would have rated the hotel with 4 stars if it wasn't for the thin walls.","date":"2011-10-28","reviewCount":154,"usefulCount":268,"coolCount":127,"funnyCount":44,"complimentCount":9,"fanCount":12,"restaurantRating":3.5}
{"restaurantID":"kgMEBZG6rjkGeFzPaIM4MQ","reviewerID":"MfDqmwzf1WxvJFtiRKi4Sg","rating":1,"reviewUsefulCount":2,"reviewContent":"I know I shouldn't expect much but everything I asked for that was on the drive thru menu was not available. I was actually afraid of what I was going to get once I did get it. I saw the movie \"waiting\".  Word of advice stay clear of this arch. Just so you know I was only trying to order a beverage how pathetic is that.","date":"2012-05-28","reviewCount":100,"usefulCount":114,"coolCount":23,"funnyCount":12,"complimentCount":0,"fanCount":5,"restaurantRating":2.0}
{"restaurantID":"GBTPC53ZrG1ZBY3DT8Mbcw","reviewerID":"tt2qIFKZumubxk_UwXhijA","rating":5,"reviewUsefulCount":0,"reviewContent":"This was our second choice after finding out Rio Mar was closed for Mardi Gras week. We had a hell of a time getting here since it was on the other side of the parade from where we were staying.    Nonetheless, we had a great meal.      Service was spot on. Professional but not overbearing or obvious.      A little disappointed that they were out of two ingredients for one of their signature cocktails, but it WAS the day before Mardi Gras.    The bread and butter at the table was excellent. Crunchy outside, soft inside.    The beets salad was so much better and different from similarly named items at other restaurants. The greens literally tasted like they had been picked from a sun warmed field minutes before.     G's Choucroute was a meaty fiesta. He loved it. My crab ravioli was lovely with a delicate Meyer lemon sauce.      Bread pudding for dessert was just how we like it - sans raisins.     Truly a memorable meal. Way better than most hotel restaurants.","date":"2009-03-01","reviewCount":200,"usefulCount":384,"coolCount":177,"funnyCount":148,"complimentCount":4,"fanCount":12,"restaurantRating":4.0}
{"restaurantID":"roc-xyyzN5b_nImb0NdRLQ","reviewerID":"hWDybu_KvYLSdEFzGrniTw","rating":4,"reviewUsefulCount":6,"reviewContent":"As airport grab-and-go restaurants are, Earl does a decent job with a variety of sandwich options including turkey, tuna and even a Hawaiian. But today I could smell the roast beef and so I got that one. Yum. Good portion of sliced beef that was beyond medium cooked with cheddar cheese and a yummy horseradish sauce. Nope, don't get lettuce or tomatoes on it. It's perfect the way it is.  And since it's right between the security station and the top of the D gates (right near the Delta SkyClub!), it's easy to get and eat at the gate or on board.","date":"2015-01-03","reviewCount":16567,"usefulCount":173089,"coolCount":144849,"funnyCount":98459,"complimentCount":4375,"fanCount":867,"restaurantRating":3.5}
{"restaurantID":"xvdsyHdYsEbm_Cqs0BgdEw","reviewerID":"UxCu8MMi3gUK-HEz0afwDQ","rating":2,"reviewUsefulCount":0,"reviewContent":"The location is pretty random (at the end of a long winding road with a bunch of other hotel off of the highway with no food nearby) and the building has seen better days.    My room featured an unclean floor, torn wallpaper, dusty bathroom vents, and water spots in the bathroom.  The hallways might remind one of \"red rum\" and the building itself is ugly showing it's age as a product of the 70s (as am I so I can judge).  The bed was comfortable and the room serviceable but it was disappointing as I have grown accustomed to a higher level of quality in my Doubletree experience throughout the country.","date":"2013-05-07","reviewCount":290,"usefulCount":598,"coolCount":192,"funnyCount":276,"complimentCount":5,"fanCount":12,"restaurantRating":3.0}
{"restaurantID":"ffvS2BlFwQra5FTPNk5N2g","reviewerID":"LhaYPYXDepWLBzeX5mNTxw","rating":1,"reviewUsefulCount":0,"reviewContent":"Hubby and I were eager to try this establishment due to a rave review from some close friends. We decided for our date night we would give it a try on Saturday. We pulled up about 8pm and the open sign was turned off. We thought maybe the light was burnt out or someone just forgot to plug it in. So we proceeded to the door. There were people inside and the sign said open till 11pm, so we walked inside. It was like walking into the Twlight Zone, everyone stopped and stared at us. The woman behind the bar came over and told us they were closed. HUH! Ok.... so we left. It was very akward and unpleasant. If they were closed then the door should of been locked or a sign on the door stating private party or something.  Not sure if we will attempt to try to dine there again.","date":"2013-01-27","reviewCount":66,"usefulCount":37,"coolCount":10,"funnyCount":8,"complimentCount":1,"fanCount":1,"restaurantRating":4.5}
{"restaurantID":"ISBBeqLeERHiKfqa7PZkuA","reviewerID":"WQhgAg8ovchnA1FZCpbyWA","rating":4,"reviewUsefulCount":3,"reviewContent":"This place is a little harder to find but worth the hunt. B's Diner is a little hole-in-the-wall joint populated by neat antiques, funny posters, and the warmth and personality of their staff. They do incredible work in the community and they are worth supporting.  If you are looking for an affordable meal or are looking to have a hearty bite at somewhere chill- this is your spot. It's got that great diner feel and the personality is all in the food.  I think part of the fun is the people-watching at this joint. Whyte ave bar staff the morning after, hipsters, musicians- never a dull moment.  I've heard the Elk sausage and perogie poutine is amazing, but I've yet to try it.","date":"2011-01-08","reviewCount":49,"usefulCount":185,"coolCount":94,"funnyCount":58,"complimentCount":21,"fanCount":9,"restaurantRating":3.5}
{"restaurantID":"W4ZEKkva9HpAdZG88juwyQ","reviewerID":"86Fgk1s0tAVioJtVnJeBHg","rating":5,"reviewUsefulCount":1,"reviewContent":"If you're looking for a great brunch place in New Orleans, definitely come here!  My boyfriend and I had brunch here on Sunday, and we loved it! We both started with the Brandy Milk Punch, which was divine.  If you are of age, order this drink!  It is an alcoholic milkshake, and I could literally go here just to drink that because it is so good.    They bring out fresh bread and butter, and then my boyfriend and I ordered the trio of appetizers.  The trio is quite small, but it includes a duck springroll, fried chicken livers and a fried oyster.  The duck springroll came with a wonderful tangy sauce, which I greatly enjoyed.  My boyfriend enjoyed the fried chicken livers and the fried oyster, but those are not two of my favorite things.  For my entree, I ordered the shrimp and grits.  Oh my goodness... so good! The shrimp are bacon-wrapped, and the grits are true Southern grits.  I will definitely order this dish again when I get the chance to return.  My boyfriend ordered the fish of the day, which was blackened Mahi Mahi, and he loved it.    Definitely go to Mr. B's!","date":"2014-03-14","reviewCount":124,"usefulCount":68,"coolCount":35,"funnyCount":11,"complimentCount":0,"fanCount":3,"restaurantRating":4.0}
{"restaurantID":"fgTOJRkc703E4XRdcr5zRA","reviewerID":"FuTJWFYm4UKqewaosss1KA","rating":3,"reviewUsefulCount":3,"reviewContent":"I've come from Cali where boba is very common there. However I was thinking this place would have had the same feel. After being told this place branched off from California, I was disappointed.   I'm more of a natural person. I enjoy real flavor, real fruits, and of course the perfect boba. I notice that some flavors were used by real fruits but others were just powder which I could definitely taste the different. Especially the taro flavor, being one of my favorites.   But, if you're not too concern about natural vs powder flavor then this place could be good for you. They ask what level you would like you sweetness and any additional add-ons you would like. I always get boba but sometimes the grass jelly is pretty good too! I'd recommend you try.   This is also a good place to catch up, talk, play board, card games and even do homework. I know it's always busy with students from the U of A and being told from them it's a nice area to just hang out, that's a pretty good sign.   Maybe I'm just too picky, but I think it could be better.   \"See it, taste it, Yelp it\"","date":"2016-01-30","reviewCount":269,"usefulCount":490,"coolCount":282,"funnyCount":173,"complimentCount":35,"fanCount":22,"restaurantRating":3.5}
{"restaurantID":"6dDC5PSmPEoJYuM8r8dN_A","reviewerID":"ZuyxS4F2zdBMjghIj1auAA","rating":3,"reviewUsefulCount":0,"reviewContent":"I find it hugely ironic that WF is trying to reposition itself as a 'value' food store right now when others (i.e. Trader Joe's up the street) have been doing that for years.  For value, go elsewhere.  For pretty food, lovely store displays and a feeling of smugness, check out Whole Foods.  Despite my snark, I have to admit that it's nice to see an enormous, clean and well stocked yuppie market in Reno finally.  Now that this town has been rated by National Geographic as a top outdoors place to live in, it needs the retail to support that (and I don't mean another REI).  For myself, I'm too cheap to look seriously at this place for my regular shopping needs, but for lunch and the odd stopover, it's awesome.   Beautiful produce, drool inducing cheese selections and a bakery that would break my budget if I bought everything that struck my fancy.  Plus it's proximity to the freeway (for those of us who do our shopping based on distance from the 395 or 80) makes it an ideal stop to/from the airport.","date":"2008-08-18","reviewCount":331,"usefulCount":416,"coolCount":153,"funnyCount":127,"complimentCount":3,"fanCount":14,"restaurantRating":4.0}
{"restaurantID":"8QnuWGVNBhzyYXGSeRdi4g","reviewerID":"3MpDvy5gEdsbZh9-p92dHg","rating":4,"reviewUsefulCount":0,"reviewContent":"After my ROTD  yesterday of a different Sweet CeCe's location, I realized that I had never reviewed my local source!  Anyway, I love the product.  Love love love.  And I usually like their selection of toppings - good mix between healthy and not-so-healthy.  Sometimes the girls working there aren't really paying attention or are nowhere to be found.  Sometimes you have to remind them of their deals (like $5 Friday).  But I can't give it less than 4 stars because I just love it so much.","date":"2013-10-24","reviewCount":621,"usefulCount":1189,"coolCount":590,"funnyCount":388,"complimentCount":65,"fanCount":38,"restaurantRating":3.5}
{"restaurantID":"6jgRI0lDt48CY8j1GAGuKQ","reviewerID":"X5EAMkKCHTpmso9ILIFRUg","rating":5,"reviewUsefulCount":5,"reviewContent":"these people are great. through the years we've experienced everything and seen probably every doctor. these are true animal people, through and through, and you can always count on them for the best. not much else to say!","date":"2007-05-17","reviewCount":412,"usefulCount":1579,"coolCount":974,"funnyCount":956,"complimentCount":37,"fanCount":36,"restaurantRating":3.5}
{"restaurantID":"plobBsTtVUODb353xxFT_g","reviewerID":"bNkwYxdm9gFBQuqdf0Jb6Q","rating":3,"reviewUsefulCount":2,"reviewContent":"I've had better, but pretty good for a neighborhood sushi joint. I'll go back, sure.   Roll menu fairly limited, but my guess is they'd accommodate most any request. Service was attentive and speedy. All staff was eager to please. Other reviewers are right: Service is thoughtful and attentive.   I thought the rolls were all fine (Mariner, Rose #1, San Francisco), but nothing like \"aw damn!\" good. I really can't complain, except to be honest, I have had more memorable sushi. Still though, competent and perfectly acceptable.   I never knew this was here, so I'm glad I found it. For a quick pop in for sushi near the house, this can't be beat.","date":"2011-09-27","reviewCount":175,"usefulCount":211,"coolCount":62,"funnyCount":82,"complimentCount":4,"fanCount":5,"restaurantRating":3.5}
{"restaurantID":"J55AT36H5EeJ9ey8etGjHA","reviewerID":"_cdKam8UxhoPni6YwP1LQw","rating":5,"reviewUsefulCount":14,"reviewContent":"This small little donut bakery is located in one of Hermitage's oldest shopping centers!   I can imagine baking donuts is a hard job, let alone running the business...it's one of those jobs that starts in the wee hours of the morning so that the donuts are freshly made daily!  Yeu, the owner, serves not only your common popular donuts, but he also serves donuts with bacon on top, apple fritters, pigs in a blanket, breakfast pastries, and  kolaches....in addition to these yummy treats...he makes doughssants....they are what seems to be a scandalous marriage of a donut and a croissant...!!!!!!!! Need I say more? Yeah...you heard me. A doughssant! Worth the trip just to eat one of these!   Prices are considerably cheap! The doughssants are only $1.99 each! The regular donuts are about $.60 each!   These sweet donuts are my favorite treats to buy for my kid's school teachers...and they love them!   Coffee also served here!","date":"2014-01-17","reviewCount":151,"usefulCount":751,"coolCount":557,"funnyCount":452,"complimentCount":73,"fanCount":43,"restaurantRating":4.5}
{"restaurantID":"zJErbOQMKX-MwHs_ulV7DA","reviewerID":"MIUELcIEodpQuSMtwyKayA","rating":2,"reviewUsefulCount":0,"reviewContent":"Maybe I just had bad luck at this property but I am a SPG gold member... quickly approaching platinum and made a reservation at this property. I payed a good amount for my room and when I asked for a larger room they told me they where all the same. I asked did every room have adjoining doors and was told yes. I then told the front desk clerk that I could hear EVERYTHING going on next door including sneezing and even AC talking on CNN 360 very clearly. He told me to come down and get a new key and move to a room there was nobody in. They did not offer to bring me a key or help me move. When I got to the lobby the line was at least 10 people deep and there was only ONE person there. I just gave up and dealt with the noise and a few hours later they finally turned off the TV and I could sleep.  There is nothing fancy about this hotel and the service for sure needs improvement!","date":"2009-10-14","reviewCount":140,"usefulCount":191,"coolCount":53,"funnyCount":37,"complimentCount":7,"fanCount":9,"restaurantRating":3.0}
{"restaurantID":"m1EGAIfFEN9nG2_bJqnAcQ","reviewerID":"B-s-8VUnuBjGTP3d01jsyw","rating":4,"reviewUsefulCount":3,"reviewContent":"That horrible angst - you want sushi, but you're not SO hungry that you can do AYCE or want to spend $25 for lunch. So we popped in on a weekend for a late lunch and decided to order a la carte.  I ordered a long roll and a hand roll, a drink and a chocolate mochi (OMG, I am officially in love with these things) and the total cost came to just under $20 with tip.  It filled my belly enough so that I was satisfied.  Had I gone for just one more roll, I probably would have broke even with the AYCE, but I probably would've been so stuffed to the point where I wouldn't have needed to eat anything else all day - not the plan for this particular day.  The rolls tasted fresh and delicious, but the surprise was definitely the mochi - so creamy and tasty.","date":"2015-04-01","reviewCount":2505,"usefulCount":7487,"coolCount":5959,"funnyCount":3504,"complimentCount":160,"fanCount":154,"restaurantRating":4.0}
{"restaurantID":"AY1SyySRyTnBwBdf7qfGxQ","reviewerID":"avQwKRvXc21koLCbahFEig","rating":5,"reviewUsefulCount":3,"reviewContent":"From the second you walk in the door, you're greeted by the adorable woman at the counter. It seems if you come in here more than once a week, she'll know you're name but I haven't been so lucky since my visits are a bit more sporadic.  My most recent discovery are the vegetarian breakfast sandwiches, which are served all day! I particularly enjoy veg. sausage w/ havarti on an everything bagel. I could actually go for one right about now... I've also had the veggie club sandwich and my other half has enjoyed the chicken cheesesteak hoagie and the chicken salad on a croissant. Everything always taste fresh, they are priced really well  (I think my favorite bagel sandwich I mentioned is $2.09-2.99- cheaper than wawa!). The people at the deli are super helpful, offering menus if you can't read the one on the wall and will make great suggestions and accommodations to your needs and want.  Don't forget to grab a really great snack too while you're there- they have amazing chocolate bars, an incredible drink case, tons of chip varieties and those addictive hi-chew candies in every flavor.  I know i'll be back here, who doesn't like fast / delicious / attentive service?","date":"2009-08-04","reviewCount":108,"usefulCount":225,"coolCount":155,"funnyCount":85,"complimentCount":8,"fanCount":11,"restaurantRating":4.5}
{"restaurantID":"oRZzKWdyMQld6N_y4UWkAg","reviewerID":"amIUTkKQlA4464-lJlwlaQ","rating":4,"reviewUsefulCount":0,"reviewContent":"Cinco de mayo means margaritas and sangria and all things fried... this great place does a nice job with combining flavors of several different ethnicities and backgrounds and develops recipes that are unique.  Although not touted as a \"Mexican\" destination they know how to rock the rock salt and pour that tequila.  They also just opened a wine bar a couple doors down for overflow and specialty bottles.  A high five for the on the rocks margaritas and house made white or red sangria - definitely worth the trip!","date":"2013-05-07","reviewCount":115,"usefulCount":261,"coolCount":135,"funnyCount":89,"complimentCount":10,"fanCount":13,"restaurantRating":4.0}
{"restaurantID":"nOyphAl0JQ8JrvNi93pclQ","reviewerID":"1PJ-RjMqXHeymSkLRzuIdA","rating":2,"reviewUsefulCount":3,"reviewContent":"So I no longer go here which is a shame because The eyebrow waxing here is fantastic. I am giving this 2 stars because when I have contacted for an appointment via the phone, it usually has taken days for me to get a response. The online booking is useless because I rarely have found appointments within 2 weeks of when I need it (and I'm very flexible with time of day).   I give up on this place. Unless you book out weeks in advance, you will not get an appointment. I'm now paying $10 more elsewhere which sucks but I'm able to get seen when I need to be seen.","date":"2014-10-28","reviewCount":1556,"usefulCount":3431,"coolCount":1073,"funnyCount":1517,"complimentCount":45,"fanCount":82,"restaurantRating":4.5}
{"restaurantID":"grjFEAN9gXOKQFEta4yBJg","reviewerID":"Y_2jMUKz6pvJ0JSWG3u10A","rating":4,"reviewUsefulCount":2,"reviewContent":"My dad and I stopped in on the way back to the hotel because we wanted a 2nd drink after being disappointed with our first at another place. We ordered the hand grenades rather than pore over the menu. There was a band playing so we decided to sit for a bit Holy cow on those drinks!! They were $9 each (with souvenir cup) and we were really feeling it towards the end of the drink. It was during the day and we were enjoying the nice weather and band playing. This place was on the corner of Bourbon, close to Jackson Square and there was lots of open air coming through. We were singing along with the band which is an indication of how good that drink made us feel, lol. We had a lot of fun, good atmosphere in that bar.","date":"2015-05-12","reviewCount":724,"usefulCount":1849,"coolCount":979,"funnyCount":672,"complimentCount":87,"fanCount":58,"restaurantRating":4.0}
{"restaurantID":"cx2fwY66_xTNFo0p2EEC4g","reviewerID":"yPdPATvZ95l366Pp8nVzLQ","rating":4,"reviewUsefulCount":1,"reviewContent":"I recently went here with the hubby and a friend and we got the vegetable pakora to start- which was like veggies and hushpuppies all in one- YUM! Then we each got an entree: chicken tikki masala, lamb roganjosh, and lamb vindaloo. Each dish was superb, authentic, and exactly what it should be. The sauces for each were so good I wanted to drink them. Had I saved any room in my tummy, I just might have!   The place was reasonably priced and the staff/service was just okay. All-in-all, a great addition to Media's varied dinner spots. The lunch buffet looked promising, too, and is only $9.95 on weekdays, $10.95 on wknds.","date":"2011-09-26","reviewCount":375,"usefulCount":461,"coolCount":164,"funnyCount":108,"complimentCount":12,"fanCount":26,"restaurantRating":4.0}
{"restaurantID":"f06mf_7bT8FibS2UejNrfg","reviewerID":"JW_742Kc_BeN-tvACR88ew","rating":5,"reviewUsefulCount":2,"reviewContent":"Great store. Insane selection. Incredible customer service.  Wish they could come to Ft. McMurray.   :(","date":"2012-06-26","reviewCount":232,"usefulCount":402,"coolCount":266,"funnyCount":114,"complimentCount":11,"fanCount":11,"restaurantRating":4.0}
{"restaurantID":"Zcc12beUPFCe2U0DizJUNg","reviewerID":"z497rLw1L767W-9Umwgt1g","rating":3,"reviewUsefulCount":2,"reviewContent":"As motels go this one is very nice for the rate. Clean, comfortable and well-managed. You get what you pay for so the breakfast buffet is just OK. The pool is too small to swim laps (disappointing). The lobby area is spacious and comportable.   If you are looking for a moderately priced place to sleep that is clean and comforable this will suit you just fine.","date":"2011-11-30","reviewCount":317,"usefulCount":561,"coolCount":168,"funnyCount":142,"complimentCount":38,"fanCount":12,"restaurantRating":4.0}
{"restaurantID":"_d5OAxaxRPsivgYbBq7U1A","reviewerID":"m3XeAlZN5mBjp7ynqe8_XQ","rating":5,"reviewUsefulCount":0,"reviewContent":"This hotel was fantastic. I was in town for a week, working at my company's PA office in Wayne. Great location and easy to get in and out. Hotel staff was very friendly. Room was immaculately cleaned and very spacious for just one person. Kitchenette was fully stocked with dishes, silverware, utensils, a small dishwasher and a full size fridge. Windows surrounding the king size bed were great- lots of natural light. I liked that opting out of housekeeping got me a $5 credit at the restaurant.   The pool is small but no one was there the two times I went to use the hot tub. The bar has a decent drink selection, although I was bummed they were out of mint and couldn't make a mojito (which was on the drink menu). Burger was okay. Dessert was mediocre (but free with my $5 credit, so nbd). Omelet station was a nice touch in the AM. Coffee frequently had coffee grounds in it/was very weak, but the breakfast spread overall was nice.","date":"2015-07-03","reviewCount":137,"usefulCount":376,"coolCount":77,"funnyCount":120,"complimentCount":1,"fanCount":9,"restaurantRating":3.5}
{"restaurantID":"R-HCwu9UbasUudG1yTM1Ow","reviewerID":"Wshkpj8aHWuzIeca1QxWTA","rating":1,"reviewUsefulCount":13,"reviewContent":"I am positively LIVID.  I went to check my account balance and what do I see? An overdraft fee of $220. How could this happen? My card was never declined and there are two large fees deducted from my account.  I called TD and sat on hold for 45 MINUTES. I don't have that kind of time. Granted, the guy that was with me was nice and helpful, but never mentioned anything about the wait time until I brought it up. I asked about these fees and he said \"Just so you are aware, TD Bank's new policy is that when you have insufficient funds, your card will not be declined. It will be run through, and you will be charged an overdraft fee.\" OH THANK YOU FOR TELLING ME NOW, JERK.  I have too many salty words that are unacceptable in the public domain, so I'll stop now.  Needless to say, I am switching banks.  Sort of UPDATE: I thought you Yelpers would like to know that last night, when I was depositing the cash that I didn't have into my account via ATM, I flipped off the cameras. TAKE THAT, TD.","date":"2009-10-15","reviewCount":175,"usefulCount":1012,"coolCount":772,"funnyCount":832,"complimentCount":136,"fanCount":28,"restaurantRating":2.5}
{"restaurantID":"0zH0l4Jbf-oove3cLvrFOg","reviewerID":"tp8Hka1k8dVzhLwhYFVClA","rating":4,"reviewUsefulCount":0,"reviewContent":"Food is on point.  I am deducting 1 star for the condition of the bathrooms on the Friday night I went.. Toilet didn't flush, no toilet paper or paper towels and overall gross.","date":"2016-07-25","reviewCount":45,"usefulCount":125,"coolCount":52,"funnyCount":46,"complimentCount":0,"fanCount":2,"restaurantRating":4.0}
{"restaurantID":"uW2oyOCEN3RgS7j2MfUIkg","reviewerID":"x_NfifOcHluxCC84iC-0Rg","rating":5,"reviewUsefulCount":1,"reviewContent":"I got the hot shave and it did not disappoint. They do 6 towels and a facial massage with oils in between. Great shave, great environment.","date":"2018-06-09","reviewCount":13,"usefulCount":9,"coolCount":3,"funnyCount":0,"complimentCount":0,"fanCount":0,"restaurantRating":4.5}
{"restaurantID":"alUk6OwNhofyc90NDMDY-Q","reviewerID":"YwMD-AVT67fmYRGxnlRSPA","rating":5,"reviewUsefulCount":7,"reviewContent":"Was taken here today by a Colombian friend who needed to satisfy a craving for something cheap and delicious. This place reminds me of Nanzhou, a Yelp favorite, because of the heaping helpings you get for next to nothing.   I got the oxtail soup (Sancocho) with extra rice and plantains to see how it would differ from the Korean-style stuff I was used to at home. Aside from a thicker, stew-like broth and beefier potatoes, it was just as delicious. My friend got a flat steak (Carne Asada) that I think he ate in just under 10 seconds.   Remember Yelp, you're missing out on a lot if you don't visit NE philly once in a while, especially this place.","date":"2010-08-22","reviewCount":262,"usefulCount":376,"coolCount":148,"funnyCount":107,"complimentCount":13,"fanCount":12,"restaurantRating":4.5}
{"restaurantID":"0vCsslN-TYnDeOSNT4rIfg","reviewerID":"63-2PK0__Z3Zr1X-2mu1wQ","rating":4,"reviewUsefulCount":4,"reviewContent":"We've been shopping here since this location was a Wild Oats. Perhaps I'm just imagining things, but I'd swear it has gotten better since the merger of these two chains.  I love the produce, seafood and cheese here. But it's the personal care section with tons o' natural cosmetics, handmade soaps and the like that brings us in most often. Well, that and the salad bar. In the cooler months, nothing beats hitting Whole Foods for a post-yoga lunch of soup and salad or the deli salad sampler plate. The Carrot Ginger, Split Pea and Corn Chowder soups are the best! Other sure bets: the curried tofu salad (or pretty much any of the deli-made tofu items), sushi to-go boxes and the everything cookies. My most recent find: lavender soda - kinda' dry and really does relax you :-)","date":"2008-08-18","reviewCount":314,"usefulCount":721,"coolCount":226,"funnyCount":126,"complimentCount":5,"fanCount":27,"restaurantRating":3.5}
{"restaurantID":"mUIBtlWNPD7sz3rGGWQ1RA","reviewerID":"mzXDuhZBPdHfMIk1YXP0mQ","rating":5,"reviewUsefulCount":3,"reviewContent":"I moved from Chicago to Philadelphia over a year ago.  Everybody here raves about the restaurants, but I have yet to find many that deserve five stars, or even four.  This is the best restaurant I have eaten in in Philadelphia.    Tahini and bread  arrived at the table, and I thought, hum, plain but I'm hungry.  They must put crack in that Tahini.  I wanted to lap it out of the bowl like an uncouth dog.  The bread is excellent too.  I love a menu with many organic meat choices.  How often can you order an organic beef shishkabob?  It was superb.  The meat done perfectly, the onions nearly caramelized but not quite so they still had some substantive crunch.  The purslane salad tasted like I was eating a plant in the middle of a garden.  It is not often that I dream about a salad but I do dream about this one  My husband had a chicken dish with black eyed peas and green peas and fantastic rice.  I won't begin to describe the flavoring; it is beyond my culinary vocabulary.  We asked what spices they use, and in addition to traditional zatar, they use their own blend of spices.  I don't even need to know what is in it just so long as we can keep coming back and ordering it again and again.  I was so full but ate dessert none the less, which I usually don't do.  But when a diner is this good, I had a feeling the desserts would be too and I just needed to find out.  Pistachio creme brulee.  It could have come out over the top, but no indeed.  It was pure pistachio heaven in s super light yet rich custard.  Heaven. Heaven.  Our service was superb.  The squeezed us into a last minute Friday night reservation with the caveat that we would need to get through our dinner in an hour and 15 minutes in order to accommodate a reservation made prior to us.  Given the time constraints they never made us feel rushed and timed the meal perfectly.  Then my husband left to go to the restroom, the waiter picked up his napkin and refolded it nicely on the table.  Do I care about the napkin placement in the middle of a meal?  Not really, but it is a sign that the waitstaff is incredibly attentive and extremely well trained.    My eating out plan for Philly might just be to skip eating most everywhere most of the time so I can frequent this expensive, though appropriately priced restaurant.  Kudos to the chef.","date":"2013-08-03","reviewCount":455,"usefulCount":1512,"coolCount":322,"funnyCount":341,"complimentCount":7,"fanCount":32,"restaurantRating":4.5}
{"restaurantID":"Jc6MxMyCLp4DMfN4C1t1aQ","reviewerID":"yyxEa8y4HGij_m7g1wDKWg","rating":3,"reviewUsefulCount":0,"reviewContent":"It's really a run of the middle as far as Cuban food goes. Not bad but not great either. I work close by so I end up there for lunch quite a bit. It's definitely worth checking out for lunch as their specials change every day and prepared freshly.","date":"2015-04-15","reviewCount":82,"usefulCount":66,"coolCount":17,"funnyCount":10,"complimentCount":2,"fanCount":5,"restaurantRating":4.0}
{"restaurantID":"g5ogvPhw3PSobtaZFkdEXg","reviewerID":"sws7O4Ek6gq6fTRA5d-rWw","rating":4,"reviewUsefulCount":0,"reviewContent":"Beautifully sweet ending to a sweet trip to NOLA with the girls. We stumbled upon this after a delicous savory lunch nearby at Cochon (review to follow). Sweet Confections is on Magazine St, around corner from the art gallery strip on Julia St.   We had a sampling of cupcake (chocolate with mocha filling) and truffles (raspberry, creme brulee, and orange).  Cupcake was good, mocha filling best part. Rasberry truffle was my fav, love the dark chocolate so it's not cloyingly sweet. The coffee was a wonderful chaser, not overly burnt, smoky, or acidic... I usually have coffee with milk n sugar, forgot this time, but I didn't even need it!  Seating was nice, with a few cafe tables inside. Enough for our 6-girl troop. And service was great, helpful with flavor suggestions and labelling.  Gave 4 of 5 stars because maybe they could benefit from one more equally gracious staff person.","date":"2012-04-28","reviewCount":5,"usefulCount":1,"coolCount":1,"funnyCount":0,"complimentCount":1,"fanCount":3,"restaurantRating":4.5}
{"restaurantID":"s3FRhtaNU8dt-mKkLKUQaQ","reviewerID":"dEXDFQs_mLhhbXBkFlj8MA","rating":4,"reviewUsefulCount":1,"reviewContent":"Just had a late dinner there on a Sunday night and was really surprised at how good the sushi was and how low my ticket was. I had a plate full of sushi and it cost me $13.00. The staff seems to be having a good time too. Very friendly place. I really enjoyed it and will be back soon!","date":"2011-03-21","reviewCount":29,"usefulCount":29,"coolCount":3,"funnyCount":8,"complimentCount":0,"fanCount":0,"restaurantRating":3.0}
{"restaurantID":"kxX2SOes4o-D3ZQBkiMRfA","reviewerID":"mqBWACmaHflW4eh_Ofp16Q","rating":5,"reviewUsefulCount":13,"reviewContent":"After a long hiatus from reviewing I have awaken from my 6 mouth yelp hibernation and my tummies a grumbles with an insatiable hunger for the cacophonous symphony of flavor that is Indian food. Like an all too familiar pattern, I go back to Mohammad Butt, my main man for marsala. But whats this?  There are whispers that he no longer cooks for \"Best Taste of Asia,\" that he is gone, never to return; some sort of falling out.  No. No, it can't be!  I need to score - one .. final .. hit..  Life ceases to have meaning, existential murmurings dog the mind. Who am I? Why am I here? What is Cheeze Wiz? Its done, over, a round falls into the chamber and just as I prepare to end it all and pull the trigger- steps in ZAIKA.  Zaika - meaning the art of taste -  stays to to its name. This is a place where the Paneer (cheese) is made fresh in house, resulting in a cheese that's silky in texture. Especially when in contrast to the prepackaged rubbery bone-white LEGO blocks most small Indo-Pak places purchase from Indian Grocers in attempts to reduce prep-times. While at Zaika such shortcuts are not taken,  the Chef takes the extra steps needed to ensure a dish comes together as a whole. For example, the Chicken Makhani uses Smokey Tandoori Chicken, which I have never seen done before but it certainly aids the chicken to cut though the rich buttery tomato sauce and elevates the dish as a whole. Even entres like Dall Fray or  Palak Paneer  have so much flavor that they will leave you not missing animal protein in the least should you choose to go the vegetarian route.   Zaika 's appetizers, like the Veggie Samosa and Aloo Tikki, (spiced potato patties) are generally large, peppery and well spiced - the latter of which remind me of something my own mother would make. Though I must warn others to avoid the items that occasionally pop-up as specials like the potato stuffed chili peppers, unless they have a iron stomach or are a gluten for punishment. These peppers are spicy, not deveined or even seeded. Further, I find the fish pakora to be far too fishy.   I've become rather taken by Zaikia. Even the simply things such as the naan are good there. Just right in elasticity, the bread does not have too much give and yet isn't too soft. It's nothing elaborate, just properly risen with a light texture and  no egg or yeast flavor. The only complaint being that it lacked that signature faint sweetness naan has. But hey, I use it mostly for mopping up the other good stuff on the plate anyway and the sweetness gets lost in the mix, so I don't mind at all.  The menu has nearly 120 different items, all numbered to order by, making take-out phone orders convenient and should eliminate any fears anyone should have of a language barrier problem. Furthermore, it has short descriptions of each dish - something all ethnic places like this should have. Though some items like Lassie (a frothy yogurt drink) do not appear on the menu, that too is offered - both a salty and sweet mango verities.  The head chef speaks English quite well and should be easy to deal with should you want to inquire more or want to setup large orders.  I have already noticed parties negotiating catering for Ramadan as I anxiously awaited my own order.  The bottom line here is this, Mohammad Butt has expanded on the menu he once created for \"Best taste of Asia,\" and taken an all HALAL meat approach.   Only good things can come of this, only good things.  P.S. ZAIKA is right behind Nifty Fifties on Grant Ave., so you are all set for dessert should you want a milkshake.  However, I would suggest getting the Ras Malai if available. These riccotta cheese dumplings flouting in soaked in sweetened, thickened milk are delicately flavored with cardamom, a very some amount of rose water and then garnished with pistachios. They are ungodly good.","date":"2010-08-20","reviewCount":38,"usefulCount":217,"coolCount":125,"funnyCount":90,"complimentCount":9,"fanCount":4,"restaurantRating":4.0}
{"restaurantID":"5FDt7sy-70y4_37Dh2qcbw","reviewerID":"Snibkmu9icOiNSKvnQEFNA","rating":3,"reviewUsefulCount":0,"reviewContent":"So, I went back to El Arado on Monday with a group of six people. The staff seemed shocked about our 6 pm arrival, and \"sanitized\" a large table for us quickly. Yes, the table smelled like dirty sanitized rags, ugh, but, once you got buzzed on...I mean beyond, the smell, your waiter will appear and take your drink orders.   We got beers and margaritas. The margarita drinker in the group declared that it \"was good.\"  The prices for drinks weren't that bad.  ($2.95 for Mexican beers).   We all ordered our food, which was brought out at a good time, fresh, and hot. Everyone snarfed - it was good and tasty and all our needs were met attentively by the quiet waiter.   All of us were let satisfied, and our specific requests (i.e. \"no beans\" \"light on the cheese\") were met by the kitchen staff with no problems. We left with full bellies then went to the Red Garter for a mind-numbing strip club experience.   What a way to wrap up a review..  El Arado has gotten a bad wrap - but, the staff is decent, the food wasn't too shabby and the drink prices are cheap. A good place to start out for affordable and filling eats before a night out in Fountain Square (or to strip clubs).","date":"2010-01-09","reviewCount":419,"usefulCount":898,"coolCount":415,"funnyCount":296,"complimentCount":7,"fanCount":50,"restaurantRating":3.0}
{"restaurantID":"VJEzpfLs_Jnzgqh5A_FVTg","reviewerID":"IKbjLnfBQtEyVzEu8CuOLg","rating":4,"reviewUsefulCount":0,"reviewContent":"It was my fiance's birthday and he decided he wanted a good, laid back Thai restaurant for dinner. Yelp steered us in the Jasmine Rice direction, and it was definitely a good decision. We wanted the summer rolls, which were on the menu, but apparently will not be available until summer, so we settled on the pan-fried dumplings. The flavor was good, but I don't think we'd order them again. We got the green curry fried rice with duck and chicken pad thai. Both of those dishes were great, but the duck stole the show. That was some the of tastiest duck I've ever had. The pad thai was a bit sweet for us, so I think we'd try a different noodle dish when we return. But it was still very good, especially with some chili sauce mixed in. Our service was good, but other people had issues. One table was rushing to get to a show at the Kimmel Center and waited quite a while for their meal (and were going to be late). Another person who got take-out was missing one of their items (but the owner realized it and called him and walked the dish to his house, which was very nice). Overall, good quality Thai! We would definitely go back.","date":"2014-04-01","reviewCount":800,"usefulCount":1571,"coolCount":671,"funnyCount":290,"complimentCount":37,"fanCount":64,"restaurantRating":3.5}
{"restaurantID":"NMtUD873aWrNjljt3VOcFA","reviewerID":"1q46zMl7G6TAJ_1Ky5tfCQ","rating":4,"reviewUsefulCount":0,"reviewContent":"Pros:  -Superb cheeseburger - thick, evenly cooked, (almost) medium rare, nice sauce, soft bun -Tasty (complimentary) zucchini bread -Good service -Good G+T selection -Cool ambience -Downstairs from my apartment  Cons:  -Expensive -Per wife, the waitress \"seemed disappointed\" that we only ordered cheeseburgers (this was not verified, status as a \"con\" is under review)  Looking forward to going back.","date":"2015-01-04","reviewCount":14,"usefulCount":27,"coolCount":9,"funnyCount":29,"complimentCount":1,"fanCount":2,"restaurantRating":3.5}
{"restaurantID":"vF32KjPs8BgltSa484P1Yg","reviewerID":"nlCZQEELgzkIma8ZLG9Sug","rating":5,"reviewUsefulCount":1,"reviewContent":"Stopped here for lunch on the way to drop some people off at the airport. It's a bit unexpected and a tiny bit off the beaten path on a residential street just behind a business district.  I chose the vegetarian plate and a Greek salad. The salad was the absolute best I've ever had. The cheese was absolutely fresh, the vegetables were fresh and chopped just for the salad, and the dressing and seasoning was perfect. The salad was quite large on its own and could easily make a light lunch by itself.  The vegetarian plate came along with their fresh pita-like bread that is baked fresh every morning, seasoned, pan fried vegetables, rice, and a tzatziki-like sauce drizzled on top. The flavors were astounding, and despite a lack of desire to stuff myself silly, I did anyway. Plenty of food for lunch and very reasonably priced.","date":"2014-01-17","reviewCount":8,"usefulCount":2,"coolCount":1,"funnyCount":1,"complimentCount":0,"fanCount":2,"restaurantRating":4.0}
{"restaurantID":"pAgtmlIGqFYaWdBoCUeitw","reviewerID":"Fq7d14GDAsGjDoojP_ygOQ","rating":1,"reviewUsefulCount":3,"reviewContent":"The TV shows are $4.99 and they have commercials! What a cheesy way to make money and a sign of a less than classy hotel, particularly when you pay more than $150 a night.  And there is NO complimentary breakfast, just an overpriced buffet, something even the cheapest hotels in California provide.","date":"2012-12-04","reviewCount":15,"usefulCount":15,"coolCount":2,"funnyCount":1,"complimentCount":0,"fanCount":0,"restaurantRating":3.5}
